#+title: Mitch's Emacs Configuration File
#+author: Mitch Fisher
#+date: 2024-04-20
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+auto_tangle: t

*** Run This Only Once!

This is meant to be evaluated and run once. Calling this function will clone the vscode-js-debug framework. This is a DAP-based JavaScript debugger. It debugs Node.js, Chrome, Edge, WebView2, VS Code extensions, and more. It has been the default JavaScript debugger in Visual Studio Code since 1.46, and is gradually rolling out in Visual Studio proper.

#+begin_src emacs-lisp :tangle no 
  ;;; --------------------------------------------------------------------------

  (mrf/install-vscode-js-debug)
  
#+end_src

#+RESULTS:
: vscode-js-debug installed

